Import niezbÄ™dnych bibliotek.

In [1]:
import numpy as np
import pandas as pd

Wczytanie danych.

In [2]:
df = pd.read_csv('df1.csv')
df_2 = pd.read_csv('df2.csv')
df_3 = pd.read_csv('attrition.csv')
df_4 = pd.read_csv('sample_output.csv')

In [3]:
print(df.shape)
print(df_2.shape)
print(df_3.shape)
print(df_4.shape)

(4449, 20)
(4449, 17)
(4449, 2)
(147, 2)

In [4]:
df.head()

,EmployeeNumber,Age,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,JobRole,JobSatisfaction,MaritalStatus,MonthlyIncome,MonthlyRate,NumCompaniesWorked
0,104,30.0,Travel_Rarely,852.0,Research & Development,1.0,1.0,Life Sciences,1.0,4.0,Male,55.0,2.0,2.0,Laboratory Technician,4.0,Married,5126.0,15998.0,1.0
1,1638,38.0,Travel_Rarely,397.0,Research & Development,2.0,2.0,Medical,1.0,4.0,Female,54.0,2.0,3.0,Manufacturing Director,3.0,Married,7756.0,14199.0,3.0
2,164,26.0,Travel_Rarely,841.0,Research & Development,6.0,3.0,Other,1.0,3.0,Female,46.0,2.0,1.0,Research Scientist,2.0,Married,2368.0,23300.0,1.0
3,395,28.0,Travel_Rarely,1117.0,Research & Development,8.0,2.0,Life Sciences,1.0,4.0,Female,66.0,3.0,1.0,Research Scientist,4.0,Single,3310.0,4488.0,1.0
4,53,35.0,Travel_Rarely,464.0,Research & Development,4.0,2.0,Other,1.0,3.0,Male,75.0,3.0,1.0,Laboratory Technician,4.0,Divorced,1951.0,10910.0,1.0

In [5]:
df_2.head()

,EmployeeNumber,Over18,OverTime,PercentSalaryHike,PerformanceRating,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager,Attrition,YearlyIncome
0,104,Y,Yes,12.0,3.0,3.0,80.0,2.0,10.0,1.0,2.0,10.0,8.0,3.0,0.0,No,61512.0
1,1638,Y,Yes,19.0,3.0,4.0,80.0,1.0,10.0,6.0,4.0,5.0,4.0,0.0,2.0,No,93072.0
2,164,Y,No,19.0,3.0,3.0,80.0,0.0,5.0,3.0,2.0,5.0,4.0,4.0,3.0,No,28416.0
3,395,Y,No,21.0,4.0,4.0,80.0,0.0,5.0,3.0,3.0,5.0,3.0,0.0,2.0,No,39720.0
4,53,Y,No,12.0,3.0,3.0,80.0,1.0,1.0,3.0,3.0,1.0,0.0,0.0,0.0,No,23412.0

In [6]:
df_3.head()

   EmployeeNumber Attrition
0             104        No
1            1638        No
2             164        No
3             395        No
4              53        No

In [7]:
df_4.head()

   EmployeeNumber  Attrition
0          100000          1
1          100001          1
2          100002          1
3          100003          1
4          100004          1

In [8]:
df = df.join(df_2, lsuffix='_caller', rsuffix='_other')
df = df.join(df_3, lsuffix='_caller', rsuffix='_other')
df = df.join(df_4, lsuffix='_caller', rsuffix='_other')

C:\Users\nowy\AppData\Local\Temp\ipykernel_28968\1731809867.py:3: FutureWarning: Passing 'suffixes' which cause duplicate columns {'EmployeeNumber_caller'} in the result is deprecated and will raise a MergeError in a future version.
  df = df.join(df_4, lsuffix='_caller', rsuffix='_other')

In [9]:
df.shape

(4449, 41)